bzt-jmeter-load-test.yml
# https://gettaurus.org/docs/ConfigSyntax/
---
settings:
  env:
    BZT_TOKEN: ${BZT_TOKEN}

execution:

- concurrency: 3
  ramp-up: 20s
  executor: jmeter
  scenario:
    script: jmx/jmeter-test-1.jmx

- concurrency: 2
  ramp-up: 20s
  executor: jmeter
  scenario:
    script: jmx/jmeter-test-2.jmx


## If you have API Key, just export it as environment variable and uncomment the 'token'
## If No, it will upload results anonymously to BlazeMeter Dashboard
modules:
  blazemeter:
    project: Demo
    report-name: Demo Load Test Results
#    token: ${BZT_TOKEN}


# jmeter -g C:\hosang\taurus\tutorial\2021-01-20_18-03-17.307878\kpi.jtl -o C:\hosang\taurus\tutorial\2021-01-20_18-03-17.307878\report